import React, { useState, useEffect } from 'react';
import Header from '../components/shared/Header';
import Footer from '../components/shared/Footer';
import ServiceGrid from "../components/forms/ServiceGrid";
import DynamicForm from "../components/forms/DynamicForm";
import '../../src/styles/HomePage.css';
import { getMedicalServices } from '../services/api.js';


const HomePage = () => {
  // Список доступных медицинских услуг
  // const [services] = useState([
  //   {
  //     id: 1,
  //     name: "КТ (Компьютерная томография)",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Направление врача", "Область исследования"],
  //     description: "Компьютерная томография для диагностики заболеваний внутренних органов.",
  //   },
  //   {
  //     id: 2,
  //     name: "ЭКГ (Электрокардиограмма)",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Отчество", "Полис", "Возраст", "Вес", "Жалобы"],
  //     description: "Исследование электрической активности сердца.",
  //   },
  //   {
  //     id: 3,
  //     name: "Общий анализ крови",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача"],
  //     description: "Лабораторное исследование для оценки общего состояния здоровья.",
  //   },
  //   {
  //     id: 4,
  //     name: "УЗИ брюшной полости",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Вес", "Направление врача"],
  //     description: "Ультразвуковое исследование органов брюшной полости.",
  //   },
  //   {
  //     id: 5,
  //     name: "Рентген грудной клетки",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Направление врача"],
  //     description: "Рентгенологическое исследование для диагностики заболеваний легких и сердца.",
  //   },
  //   {
  //     id: 6,
  //     name: "Консультация терапевта",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Жалобы", "История болезни"],
  //     description: "Консультация врача-терапевта для диагностики и лечения.",
  //   },
  //   {
  //     id: 7,
  //     name: "МРТ головного мозга",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Направление врача", "История болезни"],
  //     description: "Магнитно-резонансная томография для исследования головного мозга.",
  //   },
  //   {
  //     id: 8,
  //     name: "Гастроскопия",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача", "Аллергии"],
  //     description: "Эндоскопическое исследование желудка и пищевода.",
  //   },
  //   {
  //     id: 9,
  //     name: "Колоноскопия",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача", "Аллергии"],
  //     description: "Эндоскопическое исследование толстого кишечника.",
  //   },
  //   {
  //     id: 10,
  //     name: "Анализ мочи",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача"],
  //     description: "Лабораторное исследование мочи для оценки состояния почек и мочевыводящих путей.",
  //   },
  //   {
  //     id: 11,
  //     name: "Консультация кардиолога",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Жалобы", "История болезни", "Результаты ЭКГ"],
  //     description: "Консультация врача-кардиолога для диагностики и лечения сердечно-сосудистых заболеваний.",
  //   },
  //   {
  //     id: 12,
  //     name: "УЗИ щитовидной железы",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача"],
  //     description: "Ультразвуковое исследование щитовидной железы.",
  //   },
  //   {
  //     id: 13,
  //     name: "Анализ на гормоны",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Возраст", "Направление врача", "Цель исследования"],
  //     description: "Лабораторное исследование уровня гормонов в крови.",
  //   },
  //   {
  //     id: 14,
  //     name: "Консультация невролога",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Жалобы", "История болезни", "Результаты МРТ"],
  //     description: "Консультация врача-невролога для диагностики и лечения заболеваний нервной системы.",
  //   },
  //   {
  //     id: 15,
  //     name: "Рентген позвоночника",
  //     fields: ["Паспорт", "Имя", "Фамилия", "Полис", "Направление врача", "Область исследования"],
  //     description: "Рентгенологическое исследование позвоночника для диагностики заболеваний опорно-двигательного аппарата.",
  //   },
  // ]);

  const [services, setServices] = useState([]);

  useEffect(() => {
    const fetchServices = async () => {
      try {
        const response = await getMedicalServices();
        setServices(response.data);
      } catch (error) {
        console.error('Ошибка при загрузке услуг:', error);
      }
    };

    fetchServices();
  }, []);


  // Выбранная услуга
  const [selectedService, setSelectedService] = useState(null);
  // Обработчик выбора услуги
  const handleServiceSelect = (service) => {
    setSelectedService(service);
  };

  // Закрытие формы
  const handleCloseForm = () => {
    setSelectedService(null);
  };

  return (
    <div className="home-page">
      <Header />
      <main>
        <div className="homePage">
          <h1>Доступные медицинские услуги</h1>
          <ServiceGrid services={services} onSelect={handleServiceSelect} />
          {selectedService && (
            <DynamicForm service={selectedService} onClose={handleCloseForm} />
          )}
        </div>
      </main>
      <Footer />
    </div>
  );
};

export default HomePage;